#ifndef _COM_CONTROL_H // Блокируем повторное включение этого модуля
#define _COM_CONTROL_H
//******************************************************************************
// Секция include: здесь подключаются заголовочные файлы используемых модулей
//******************************************************************************
#include <math.h>
#include <stdio.h>
#include <stdlib.h>
#include "stm32f4xx_hal.h"
#include "trx.h"
#include "codec.h"
#include "core.h"
#include "allpass.h"
//******************************************************************************
// Секция определения констант
//******************************************************************************
#define S_METER_INTERVAL                      0



//******************************************************************************
// Секция определения типов
//******************************************************************************
//typedef struct
//{
//...
//} T_STRUCT;
//typedef ...
//******************************************************************************
// Секция определения глобальных переменных
//******************************************************************************
extern REG_t R;    
extern RTC_HandleTypeDef hrtc;
extern UNIQUE_ID DevID;
//******************************************************************************
// Секция прототипов глобальных функций
//******************************************************************************
void UART1_IT_routine (void);
void USART1_read_command (void);
void RC_start_Init (void);                                                      // Инициализация переменных при старте
void S_meter_Send (void);                                                       // Отправить в СОМ порт показания S-метра
void Status_Send (void);                                                        // Отправить в СОМ порт статус

void save_settings (void);                                                      // Сохранение настроек в память батарейного домена
void restore_settings (void);
void load_default_settings (void);                                              // Загрузить стартовые настройки в батарейную память
//****************************************************************************** 
// Секция определения макросов
//******************************************************************************
//#define MACRO1 ...
//#define MACRO2 ...
//#define ...
#endif // Закрывающий #endif к блокировке повторного включения
//******************************************************************************
// ENF OF FILE
//******************************************************************************