#ifndef _SELECT_H // Блокируем повторное включение этого модуля
#define _SELECT_H
//******************************************************************************
// Секция include: здесь подключаются заголовочные файлы используемых модулей
//******************************************************************************
#include <math.h>
#include <stdio.h>
#include "dds16.h"
#include "stm32f4xx_hal.h"

//******************************************************************************
// Секция определения констант
//******************************************************************************
#define MARK_TONE       2725                                                    // Частота "1" в Гц
#define SPACE_TONE      2650                                                    // Частота "0" в Гц
#define SAMPLE_RATE     8138                                                    // Hz
#define SAMPLE_LEN_TICK 160                                                     // Длина сигнала в сэмплах 8к
#define SIGNAL_LEN_BIT  11                                                      // Barker sequence len


//******************************************************************************
// Секция определения типов
//******************************************************************************
typedef struct
{
  float MA_M_I;
  float MA_M_Q;
  float MA_S_I;
  float MA_S_Q;
  
  float GA_M_I;
  float GA_M_Q;
  float GA_S_I;
  float GA_S_Q;
  
  float MA_M;
  float MA_S;
  
  float GA_M;
  float GA_S;
  
  float MA_Int_M;
  float MA_Int_S;
  
  float GA_Int_M;
  float GA_Int_S;

} SQL_RX_t;

//******************************************************************************
// Секция определения глобальных переменных
//******************************************************************************
//extern char GlobalVar1;
//extern char GlobalVar2;
//extern ...
//******************************************************************************
// Секция прототипов глобальных функций
//******************************************************************************
float    create_TX_SQL_signal   (uint16_t *Type, uint16_t Scale, float In);     // Сгенерировать сигнал на открытие или закрытие шумоподавителя                                     
uint8_t  select_RX_channel      (float MA_Ch, float GA_Ch);                     // Выбираем канал в котором лучше сигнал шум
//******************************************************************************
// Секция определения макросов
//******************************************************************************
//#define MACRO1 ...
//#define MACRO2 ...
//#define ...
#endif // Закрывающий #endif к блокировке повторного включения
//******************************************************************************
// ENF OF FILE
//******************************************************************************