#ifndef _SELECT_H // Блокируем повторное включение этого модуля
#define _SELECT_H
//******************************************************************************
// Секция include: здесь подключаются заголовочные файлы используемых модулей
//******************************************************************************
#include <math.h>
#include <stdio.h>
#include "dds16.h"
#include "stm32f4xx_hal.h"

//******************************************************************************
// Секция определения констант
//******************************************************************************
//#define MY_CONST1 1
//#define MY_CONST2 2
//#define ...
//******************************************************************************
// Секция определения типов
//******************************************************************************
//typedef struct
//{
//...
//} T_STRUCT;
//typedef ...
//******************************************************************************
// Секция определения глобальных переменных
//******************************************************************************
//extern char GlobalVar1;
//extern char GlobalVar2;
//extern ...
//******************************************************************************
// Секция прототипов глобальных функций
//******************************************************************************
uint32_t create_TX_SQL_signal   (uint8_t *Type);                                // Сгенерировать сигнал на открытие или закрытие шумоподавителя                                     
uint8_t  select_RX_channel      (float MA_Ch, float GA_Ch);                     // Выбираем канал в котором лучше сигнал шум
//******************************************************************************
// Секция определения макросов
//******************************************************************************
//#define MACRO1 ...
//#define MACRO2 ...
//#define ...
#endif // Закрывающий #endif к блокировке повторного включения
//******************************************************************************
// ENF OF FILE
//******************************************************************************