#ifndef _SQUELCH_H // Блокируем повторное включение этого модуля
#define _SQUELCH_H
//******************************************************************************
// Секция include: здесь подключаются заголовочные файлы используемых модулей
//******************************************************************************
#include <math.h>
#include "stm32f4xx_hal.h"
//******************************************************************************
// Секция определения констант
//******************************************************************************
//#define MY_CONST1 1
//#define MY_CONST2 2
//#define ...
//******************************************************************************
// Секция определения типов
//******************************************************************************
typedef struct
{
  uint8_t Enable;                       // Флаг. 0 - выключено 1 - включено
  float   Out;
  float   Tmp_f;
  
  float   Mu;
  float   Leakage;
  
  float   In_buf[40];                   // Входной буфер и линия задержки
  //float   Del_buf[40];                  // Линия задержки
  float   Tmp_buf[32];                  // Временный буфер для задержки на 1 такт
  float   Coeff[32];                    // Коэффициенты фильтра рабочие
  
  
} SQUELCH_t;

//******************************************************************************
// Секция определения глобальных переменных
//******************************************************************************
//extern char GlobalVar1;
//extern char GlobalVar2;
//extern ...
//******************************************************************************
// Секция прототипов глобальных функций
//******************************************************************************
float squelch           (float In, SQUELCH_t *S);                               // LMS
float squelch_N         (float In, SQUELCH_t *S);                               // NLMS
void  squelch_init      (SQUELCH_t *S);

//******************************************************************************
// Секция определения макросов
//******************************************************************************
//#define MACRO1 ...
//#define MACRO2 ...
//#define ...
#endif // Закрывающий #endif к блокировке повторного включения
//******************************************************************************
// ENF OF FILE
//******************************************************************************