//******************************************************************************
// Секция include: здесь подключается заголовочный файл к модулю
//******************************************************************************
#include "select.h" // Включаем файл заголовка для нашего модуля
//******************************************************************************
// Секция определения переменных, используемых в модуле
//******************************************************************************
//------------------------------------------------------------------------------
// Глобальные
//------------------------------------------------------------------------------
//char GlobalVar1;
//char GlobalVar2;
//...
//------------------------------------------------------------------------------
// Локальные
//------------------------------------------------------------------------------
//static char LocalVar1;
//static char LocalVar2;
//...
//******************************************************************************
// Секция прототипов локальных функций
//******************************************************************************
//void local_func1 (void);
//void local_func2 (void);
//...
//******************************************************************************
// Секция описания функций (сначала глобальных, потом локальных)
//******************************************************************************


//******************************************************************************
// Выбираем канал в котором лучше сигнал шум
//******************************************************************************
/*
Умножаем каждый канал на SIN и COS 2600 и 2800 Гц, получаем 8 чисел
Получаем модули частот на каждом канале - это 4 числа
Сравниваем модули частот для двух каналов, получаем 2 битовых потока
Каждый битовый поток сравниваем с образцами открывающей и закрывающей последовательности

Если в каком то канале есть активная последовательность - обновляем!! на выходе номер канала
Если нет признков приема ожидаемого сигнала ничего не делаем

*/
uint8_t  select_RX_channel (float MA_Ch, float GA_Ch){

  
  
}   






//******************************************************************************
// ENF OF FILE
//******************************************************************************